app/Controllers/TicketController.php

    public function queryTicket()
    {
        $tcno = $this->request->getPost('tcno');
        $ticketModel = new TicketModel();
        $sefersModel = new SefersModel();

        // Fetch tickets that are bought
        $boughtTicketsQuery = $ticketModel->where('tcno', $tcno)
                                           ->where('is_bought', 1)
                                           ->orderBy('ticket_date', 'DESC');

        $tickets = $boughtTicketsQuery->findAll();
---
SELECT *
FROM `tickets`
WHERE `tcno` = '11111'
AND `is_bought` = 1
ORDER BY `ticket_date` DESC