app/Controllers/UserInf.php

    public function update()
    {
        $userModel = new UserModel();

        // Formdan gelen verileri al
        $data = [
            'AdiSoyadi' => $this->request->getPost('AdiSoyadi'),
            'EMail' => $this->request->getPost('EMail'),
            'Sifre' => $this->request->getPost('Sifre'),
            'Il' => $this->request->getPost('Il'),
            'Cinsiyeti' => $this->request->getPost('Cinsiyeti'),
            'Gun' => $this->request->getPost('Gun'),
            'Ay' => $this->request->getPost('Ay'),
            'Yil' => $this->request->getPost('Yil')
        ];

        // TcKimlik'e göre kaydı güncelle
        $userModel->where('TcKimlik', $this->request->getPost('TcKimlik'))->set($data)->update();
---
UPDATE `users` SET `AdiSoyadi` = 'mutsuz', `EMail` = 'mutsuz@gmail.com', `Il` = 'Çanakkale', `Cinsiyeti` = 'B', `Gun` = '1', `Ay` = 'B', `Yil` = '2021'
WHERE `TcKimlik` = '1234567'